PeterLFoy/GigaDevice-EmbeddedBuilder/WorkspaceF310/SimpleADC_DMA/firmware/gd32f3x0_hal_peripheral/Include/gd32f3x0_hal_gpio.h
/* GPIO_BC */
#define GPIO_BC_CR0                BIT(0)                /*!< pin 0 clear bit */
#define GPIO_BC_CR1                BIT(1)                /*!< pin 1 clear bit */
#define GPIO_BC_CR2                BIT(2)                /*!< pin 2 clear bit */
#define GPIO_BC_CR3                BIT(3)                /*!< pin 3 clear bit */
#define GPIO_BC_CR4                BIT(4)                /*!< pin 4 clear bit */
#define GPIO_BC_CR5                BIT(5)                /*!< pin 5 clear bit */
#define GPIO_BC_CR6                BIT(6)                /*!< pin 6 clear bit */
#define GPIO_BC_CR7                BIT(7)                /*!< pin 7 clear bit */
#define GPIO_BC_CR8                BIT(8)                /*!< pin 8 clear bit */
#define GPIO_BC_CR9                BIT(9)                /*!< pin 9 clear bit */
#define GPIO_BC_CR10               BIT(10)               /*!< pin 10 clear bit */
#define GPIO_BC_CR11               BIT(11)               /*!< pin 11 clear bit */
#define GPIO_BC_CR12               BIT(12)               /*!< pin 12 clear bit */
#define GPIO_BC_CR13               BIT(13)               /*!< pin 13 clear bit */
#define GPIO_BC_CR14               BIT(14)               /*!< pin 14 clear bit */
#define GPIO_BC_CR15               BIT(15)               /*!< pin 15 clear bit */

/* GPIO_TG */
#define GPIO_TG_TG0                BIT(0)                /*!< pin 0 toggle bit */
#define GPIO_TG_TG1                BIT(1)                /*!< pin 1 toggle bit */
#define GPIO_TG_TG2                BIT(2)                /*!< pin 2 toggle bit */
#define GPIO_TG_TG3                BIT(3)                /*!< pin 3 toggle bit */
#define GPIO_TG_TG4                BIT(4)                /*!< pin 4 toggle bit */
#define GPIO_TG_TG5                BIT(5)                /*!< pin 5 toggle bit */
#define GPIO_TG_TG6                BIT(6)                /*!< pin 6 toggle bit */
#define GPIO_TG_TG7                BIT(7)                /*!< pin 7 toggle bit */
#define GPIO_TG_TG8                BIT(8)                /*!< pin 8 toggle bit */
#define GPIO_TG_TG9                BIT(9)                /*!< pin 9 toggle bit */
#define GPIO_TG_TG10               BIT(10)               /*!< pin 10 toggle bit */
#define GPIO_TG_TG11               BIT(11)               /*!< pin 11 toggle bit */
#define GPIO_TG_TG12               BIT(12)               /*!< pin 12 toggle bit */
#define GPIO_TG_TG13               BIT(13)               /*!< pin 13 toggle bit */
#define GPIO_TG_TG14               BIT(14)               /*!< pin 14 toggle bit */
#define GPIO_TG_TG15               BIT(15)               /*!< pin 15 toggle bit */

/* GPIO_OSPD1 */
#define GPIO_OSPD1_SPD0            BIT(0)                /*!< set pin 0 very high output speed when OSPD0 is "11" */
#define GPIO_OSPD1_SPD1            BIT(1)                /*!< set pin 1 very high output speed when OSPD1 is "11" */
#define GPIO_OSPD1_SPD2            BIT(2)                /*!< set pin 2 very high output speed when OSPD2 is "11" */
#define GPIO_OSPD1_SPD3            BIT(3)                /*!< set pin 3 very high output speed when OSPD3 is "11" */
#define GPIO_OSPD1_SPD4            BIT(4)                /*!< set pin 4 very high output speed when OSPD4 is "11" */
#define GPIO_OSPD1_SPD5            BIT(5)                /*!< set pin 5 very high output speed when OSPD5 is "11" */
#define GPIO_OSPD1_SPD6            BIT(6)                /*!< set pin 6 very high output speed when OSPD6 is "11" */
#define GPIO_OSPD1_SPD7            BIT(7)                /*!< set pin 7 very high output speed when OSPD7 is "11" */
#define GPIO_OSPD1_SPD8            BIT(8)                /*!< set pin 8 very high output speed when OSPD8 is "11" */
#define GPIO_OSPD1_SPD9            BIT(9)                /*!< set pin 9 very high output speed when OSPD9 is "11" */
#define GPIO_OSPD1_SPD10           BIT(10)               /*!< set pin 10 very high output speed when OSPD10 is "11" */
#define GPIO_OSPD1_SPD11           BIT(11)               /*!< set pin 11 very high output speed when OSPD11 is "11" */
#define GPIO_OSPD1_SPD12           BIT(12)               /*!< set pin 12 very high output speed when OSPD12 is "11" */
#define GPIO_OSPD1_SPD13           BIT(13)               /*!< set pin 13 very high output speed when OSPD13 is "11" */
#define GPIO_OSPD1_SPD14           BIT(14)               /*!< set pin 14 very high output speed when OSPD14 is "11" */
#define GPIO_OSPD1_SPD15           BIT(15)               /*!< set pin 15 very high output speed when OSPD15 is "11" */

/* constants definitions */
typedef FlagStatus bit_status;

/* output mode definitions */
#define CTL_CLTR(regval)           (BITS(0,1) & ((uint32_t)(regval) << 0))

/* GPIO mode configuration values */
#define GPIO_MODE_SET(n, mode)     ((uint32_t)((uint32_t)(mode) << (2U * (n))))
#define GPIO_MODE_MASK(n)          ((uint32_t)((uint32_t)0x00000003U << (2U * (n))))

/* GPIO pull-up/pull-down values */
#define GPIO_PUPD_SET(n, pupd)     ((uint32_t)((uint32_t)(pupd) << (2U * (n))))
#define GPIO_PUPD_MASK(n)          ((uint32_t)((uint32_t)0x00000003U << (2U * (n))))

/* GPIO output speed values */
#define GPIO_OSPEED0_SET(n, speed)  ((uint32_t)((uint32_t)(speed) << (2U * (n))))
#define GPIO_OSPEED0_MASK(n)        ((uint32_t)((uint32_t)0x00000003U << (2U * (n))))
#define GPIO_OSPEED1_SET(n)         ((uint32_t)((uint32_t)(1U) << (n)))
#define GPIO_OSPEED1_MASK(n)        ((uint32_t)((uint32_t)0x00000001U << (n)))

/* GPIO output type */
#define GPIO_OTYPE_PP              ((uint8_t)(0x00U))    /*!< push pull mode */
#define GPIO_OTYPE_OD              ((uint8_t)(0x01U))    /*!< open drain mode */

/* GPIO output max speed value */
#define OSPD_OSPD0(regval)         (BITS(0,1) & ((uint32_t)(regval) << 0))

/* GPIO alternate function values */
#define GPIO_AFR_SET(n, af)        ((uint32_t)((uint32_t)(af) << (4U * (n))))
#define GPIO_AFR_MASK(n)           ((uint32_t)((uint32_t)0x0000000FU << (4U * (n))))

/* GPIO base setting*/
/* @PARA: gpio_periph */
/* @DEFINE: GPIOx(x=A,B,C,D,F) definitions */
#define GPIOA                      (GPIO_BASE + 0x00000000U)
#define GPIOB                      (GPIO_BASE + 0x00000400U)
#define GPIOC                      (GPIO_BASE + 0x00000800U)
#define GPIOD                      (GPIO_BASE + 0x00000C00U)
#define GPIOF                      (GPIO_BASE + 0x00001400U)

/* @PARA: pin */
/* @DEFINE: pinx(x=0,1,2...15) definitions */
#define GPIO_PIN_0                 BIT(0)                /*!< GPIO pin 0 */
#define GPIO_PIN_1                 BIT(1)                /*!< GPIO pin 1 */
#define GPIO_PIN_2                 BIT(2)                /*!< GPIO pin 2 */
#define GPIO_PIN_3                 BIT(3)                /*!< GPIO pin 3 */
#define GPIO_PIN_4                 BIT(4)                /*!< GPIO pin 4 */
#define GPIO_PIN_5                 BIT(5)                /*!< GPIO pin 5 */
#define GPIO_PIN_6                 BIT(6)                /*!< GPIO pin 6 */
#define GPIO_PIN_7                 BIT(7)                /*!< GPIO pin 7 */
#define GPIO_PIN_8                 BIT(8)                /*!< GPIO pin 8 */
#define GPIO_PIN_9                 BIT(9)                /*!< GPIO pin 9 */
#define GPIO_PIN_10                BIT(10)               /*!< GPIO pin 10 */
#define GPIO_PIN_11                BIT(11)               /*!< GPIO pin 11 */
#define GPIO_PIN_12                BIT(12)               /*!< GPIO pin 12 */
#define GPIO_PIN_13                BIT(13)               /*!< GPIO pin 13 */
#define GPIO_PIN_14                BIT(14)               /*!< GPIO pin 14 */
#define GPIO_PIN_15                BIT(15)               /*!< GPIO pin 15 */
#define GPIO_PIN_ALL               BITS(0,15)            /*!< GPIO pin all */

/* @PARA: p_gpio_init */
/* @STRUCT: GPIO intialization structure */
typedef struct {
    uint32_t mode;      /* refer to hal_gpio_mode_enum */
    uint32_t pull;      /* refer to hal_gpio_pull_enum */
    uint32_t ospeed;    /* refer to hal_gpio_ospeed_enum */
    uint32_t af;        /* refer to hal_gpio_af_enum */
} hal_gpio_init_struct;

/* @STRUCT_MEMBER: mode */
/* @ENUM: GPIO mode definitions */
typedef enum {
    GPIO_MODE_ANALOG    = (uint32_t)0x00000003U,                                      /*!< analog mode */
    GPIO_MODE_INPUT     = (uint32_t)0x00000000U,                                      /*!< input floating mode */
    GPIO_MODE_OUTPUT_PP = (uint32_t)0x00000001U,                                      /*!< output push pull mode */
    GPIO_MODE_OUTPUT_OD = (uint32_t)0x00000011U,                                      /*!< output open drain mode */
    GPIO_MODE_AF_PP     = (uint32_t)0x0000002U,                                       /*!< alternate function push pull mode */
    GPIO_MODE_AF_OD     = (uint32_t)0x00000012U                                       /*!< alternate function open drain mode */
} hal_gpio_mode_enum;

/* @STRUCT_MEMBER: pull */
/* @ENUM: pull-up/pull-down definitions */
typedef enum {
    GPIO_PULL_NONE = (uint32_t)0x00000000U,                                           /*!< floating mode, no pull-up and pull-down resistors */
    GPIO_PULL_UP,                                                                     /*!< with pull-up resistor */
    GPIO_PULL_DOWN                                                                    /*!< with pull-down resistor */
} hal_gpio_pull_enum;

/* @STRUCT_MEMBER: ospeed */
/* @ENUM: GPIO output max speed value */
typedef enum {
    GPIO_OSPEED_2MHZ = (uint32_t)0x00000000U,                                         /*!< output max speed 2MHz */
    GPIO_OSPEED_10MHZ = (uint32_t)0x00000001U,                                        /*!< output max speed 10MHz */
    GPIO_OSPEED_50MHZ = (uint32_t)0x00000003U,                                        /*!< output max speed 50MHz */
    GPIO_OSPEED_MAX = (uint32_t)0x0000FFFFU,                                          /*!< GPIO very high output speed, max speed more than 50MHz  */
} hal_gpio_ospeed_enum;

/* @STRUCT_MEMBER: af */
/* @ENUM: GPIO alternate function */
typedef enum {
    GPIO_AF_0 = (uint32_t)0x00000000U,                                                /*!< alternate function 0 selected */
    GPIO_AF_1,                                                                        /*!< alternate function 1 selected */
    GPIO_AF_2,                                                                        /*!< alternate function 2 selected */
    GPIO_AF_3,                                                                        /*!< alternate function 3 selected */
    GPIO_AF_4,                                                                        /*!< alternate function 4 selected (port A,B only) */
    GPIO_AF_5,                                                                        /*!< alternate function 5 selected (port A,B only) */
    GPIO_AF_6,                                                                        /*!< alternate function 6 selected (port A,B only)*/
    GPIO_AF_7                                                                         /*!< alternate function 7 selected (port A,B only)*/
} hal_gpio_af_enum;

/* @FUNCTION: initialize GPIO  */
int32_t hal_gpio_init(uint32_t gpio_periph, uint32_t pin, hal_gpio_init_struct *p_gpio_init);
/* set GPIO pin bit */
void hal_gpio_bit_set(uint32_t gpio_periph, uint32_t pin);
/* reset GPIO pin bit */
void hal_gpio_bit_reset(uint32_t gpio_periph, uint32_t pin);
/* @END */
/* initialize the GPIO initialization structure with the default values */
int32_t hal_gpio_struct_init(hal_gpio_init_struct *p_init);
/* deinitialize GPIO */
int32_t hal_gpio_deinit(uint32_t gpio_periph, uint32_t pin);
/* write data to the specified GPIO pin */
void hals_gpio_bit_write(uint32_t gpio_periph, uint32_t pin, bit_status bit_value);
/* write data to the specified GPIO port */
void hals_gpio_port_write(uint32_t gpio_periph, uint16_t data);

/* get GPIO pin input status */
FlagStatus hals_gpio_input_bit_get(uint32_t gpio_periph, uint32_t pin);
/* get GPIO port input status */
uint16_t hals_gpio_input_port_get(uint32_t gpio_periph);
/* get GPIO pin output status */
FlagStatus hals_gpio_output_bit_get(uint32_t gpio_periph, uint32_t pin);
/* get GPIO port output status */
uint16_t hals_gpio_output_port_get(uint32_t gpio_periph);

/* lock GPIO pin bit */
void hals_gpio_pin_lock(uint32_t gpio_periph, uint32_t pin);
/* toggle GPIO pin status */
void hals_gpio_bit_toggle(uint32_t gpio_periph, uint32_t pin);
/* toggle GPIO port status */
void hals_gpio_port_toggle(uint32_t gpio_periph);

#endif /* GD32F3X0_HAL_GPIO_H */
